spec/fixtures/requests/order_service/get_order_list/with_two_client_order_ids.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:web="http://api.channeladvisor.com/webservices/" xmlns:ord="http://api.channeladvisor.com/datacontracts/orders"><soap:Header><web:APICredentials><web:DeveloperKey>$$DEVELOPER_KEY$$</web:DeveloperKey><web:Password>$$PASSWORD$$</web:Password></web:APICredentials></soap:Header><soap:Body><web:GetOrderList><web:accountID>$$ACCOUNT_ID$$</web:accountID><web:orderCriteria><ord:OrderCreationFilterBeginTimeGMT xsi:nil="true"/><ord:OrderCreationFilterEndTimeGMT xsi:nil="true"/><ord:StatusUpdateFilterBeginTimeGMT xsi:nil="true"/><ord:StatusUpdateFilterEndTimeGMT xsi:nil="true"/><ord:JoinDateFiltersWithOr xsi:nil="true"/><ord:ClientOrderIdentifierList><ord:string>ABCD1234</ord:string><ord:string>EFGH5678</ord:string></ord:ClientOrderIdentifierList><ord:PageNumberFilter xsi:nil="true"/><ord:PageSize xsi:nil="true"/></web:orderCriteria></web:GetOrderList></soap:Body></soap:Envelope>